app/controllers/v1/saved_searches_controller.rb

    def index
      @paged = @user.saved_searches.paged(params)
---
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3

    def create
      saved_search = @user.saved_searches.new(saved_search_params)
---
INSERT INTO "saved_searches" ("name", "criteria", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
      if @saved_search.update(saved_search_params)
---
UPDATE "saved_searches" SET "name" = $1, "description" = $2, "criteria" = $3, "updated_at" = $4 WHERE "saved_searches"."id" = $5  [["name", "Peggie Conroy"], ["description", "COOPER, YOU REMIND ME TODAY OF A SMALL MEXICAN CHIHUAHUA."], ["criteria", "\"51105.68\""], ["updated_at", "2018-11-16 21:50:37.647523"], ["id", 640]]

    def destroy
      if @saved_search.destroy
---
DELETE FROM "saved_searches" WHERE "saved_searches"."id" = $1  [["id", 706]]

    def set_user
      @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "harvey_watsica@spencer.info"], ["LIMIT", 1]]

    def set_saved_search
      @saved_search = SavedSearch.find_by!(id: params[:id])
---
SELECT  "saved_searches".* FROM "saved_searches" WHERE "saved_searches"."id" = $1 LIMIT $2  [["id", 706], ["LIMIT", 1]]