app/controllers/v1/saved_plans_controller.rb

UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3
---
    def index
      @paged = @user.saved_plans.filtered_page(params)

INSERT INTO "saved_plans" ("plan_id", "user_id", "created_at", "updated_at", "name", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      saved_plan = @user.saved_plans.new(saved_plan_params)

UPDATE "saved_plans" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "saved_plans"."id" = $4  [["name", "Hop Rod Rye"], ["description", "Whiteboards are white because Chuck Norris scared them that way."], ["updated_at", "2018-11-16 21:50:33.175099"], ["id", 781]]
---
    def update
      if @saved_plan.update(saved_plan_params)

DELETE FROM "saved_plans" WHERE "saved_plans"."id" = $1  [["id", 848]]
---
    def destroy
      if @saved_plan.destroy

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "orpha.steuber@rathschulist.com"], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:user_id])

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 5018], ["LIMIT", 1]]
SELECT  "saved_plans".* FROM "saved_plans" WHERE "saved_plans"."id" = $1 LIMIT $2  [["id", 848], ["LIMIT", 1]]
---
    def set_saved_plan
      @saved_plan = SavedPlan.find_by!(id: params[:id])