app/controllers/v1/saved_plan_options_controller.rb

    def destroy
      if @saved_plan_option.destroy
---
DELETE FROM "saved_plan_options" WHERE "saved_plan_options"."id" = $1  [["id", 612]]

    def set_saved_plan_option
      @saved_plan_option = SavedPlanOption.find_by!(id: params[:id])
      unless current_or_guest_user == @saved_plan_option.saved_plan.user
---
SELECT  "saved_plan_options".* FROM "saved_plan_options" WHERE "saved_plan_options"."id" = $1 LIMIT $2  [["id", 612], ["LIMIT", 1]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3

    def set_saved_plan
      @saved_plan = SavedPlan.find_by!(id: params[:saved_plan_id])
---
SELECT  "saved_plans".* FROM "saved_plans" WHERE "saved_plans"."id" = $1 LIMIT $2  [["id", 634], ["LIMIT", 1]]