app/controllers/v1/users_controller.rb

INSERT INTO "user_viewed_plans" ("user_id", "plan_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1831], ["plan_id", 5055], ["created_at", "2018-11-16 21:50:43.362809"], ["updated_at", "2018-11-16 21:50:43.362809"]]
---
    def create_user_viewed_plan
      @user_viewed_plan = @user.user_viewed_plans.new(plan_id: @plan.id)
      if @user_viewed_plan.save

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "gerson_wuckert@strosinreichert.io"], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 5055], ["LIMIT", 1]]
---
    def set_plan
      @plan = Plan.find(params[:plan_id])