app/controllers/v1/vr_hotspots_controller.rb

INSERT INTO "vr_hotspots" ("name", "vr_scene_id", "created_at", "updated_at", "toggle_default", "toggle_method") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Hop Rod Rye"], ["vr_scene_id", 328], ["created_at", "2018-11-16 21:50:44.771055"], ["updated_at", "2018-11-16 21:50:44.771055"], ["toggle_default", "t"], ["toggle_method", "et"]]
---
    def create
      @vr_hotspot = @vr_scene.vr_hotspots.new(vr_hotspots_params)
      if @vr_hotspot.save

UPDATE "vr_hotspots" SET "name" = $1, "plan_option_set_id" = $2, "toggle_method" = $3, "updated_at" = $4 WHERE "vr_hotspots"."id" = $5  [["name", "Edmund Fitzgerald Porter"], ["plan_option_set_id", nil], ["toggle_method", "voluptatem"], ["updated_at", "2018-11-16 21:50:47.290614"], ["id", 507]]
---
    def update
      if @vr_hotspot.update(vr_hotspots_params)

DELETE FROM "vr_hotspots" WHERE "vr_hotspots"."id" = $1  [["id", 620]]
---
    def destroy
      if @vr_hotspot.destroy

SELECT  "vr_hotspots".* FROM "vr_hotspots" WHERE "vr_hotspots"."id" = $1 LIMIT $2  [["id", 620], ["LIMIT", 1]]
---
    def set_vr_hotspot
      @vr_hotspot = VrHotspot.find_by!(id: params[:id])

SELECT  "vr_scenes".* FROM "vr_scenes" WHERE "vr_scenes"."id" = $1 LIMIT $2  [["id", 338], ["LIMIT", 1]]
---
    def set_vr_scene
      @vr_scene = VrScene.find_by!(id: params[:vr_scene_id])