app/controllers/v1/vr_scenes_controller.rb

INSERT INTO "vr_scenes" ("name", "plan_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Oak Aged Yeti Imperial Stout"], ["plan_id", 5090], ["created_at", "2018-11-16 21:50:49.945936"], ["updated_at", "2018-11-16 21:50:49.945936"]]
---
    def create
      @vr_scene = @plan.vr_scenes.new(vr_scenes_params)
      if @vr_scene.save

UPDATE "vr_scenes" SET "name" = $1, "updated_at" = $2 WHERE "vr_scenes"."id" = $3  [["name", "Oaked Arrogant Bastard Ale"], ["updated_at", "2018-11-16 21:50:52.393285"], ["id", 659]]
---
    def update
      if @vr_scene.update(vr_scenes_params)

DELETE FROM "vr_scenes" WHERE "vr_scenes"."id" = $1  [["id", 788]]
---
    def destroy
      if @vr_scene.destroy

SELECT  "vr_scenes".* FROM "vr_scenes" WHERE "vr_scenes"."id" = $1 LIMIT $2  [["id", 788], ["LIMIT", 1]]
---
    def set_vr_scene
      @vr_scene = VrScene.find_by!(id: params[:id])

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 5100], ["LIMIT", 1]]
---
    def set_plan
      @plan = Plan.find_by!(id: params[:plan_id])